const reviews = [
    {
        id: 1,
        name: "محمد أحمد",
        rating: 5,
        date: "منذ أسبوع",

        comment:
            "من أفضل الكورسات التي درستها. الشرح واضح جدًا والمشاريع العملية ممتازة.",
    },

    {
        id: 2,
        name: "سارة علي",
        rating: 5,
        date: "منذ أسبوعين",

        comment:
            "استفدت كثيرًا وتمكنت من بناء أول Portfolio احترافي بعد إنهاء الكورس.",
    },

    {
        id: 3,
        name: "أحمد خالد",
        rating: 4,
        date: "منذ شهر",

        comment:
            "المحتوى ممتاز، وأتمنى فقط إضافة المزيد من التمارين العملية.",
    },
];

export default reviews;