module.exports = {
    common: {
        success: "تمت العملية بنجاح",
        failed: "حدث خطأ",
        notFound: "العنصر غير موجود",
        duplicate: "القيمة {{value}} موجودة بالفعل في حقل {{field}}",
    },

    course: {
        fetched: "تم الحصول على الكورس بنجاح",
        created: "تم إنشاء الكورس بنجاح",
        updated: "تم تعديل الكورس بنجاح",
        deleted: "تم حذف الكورس بنجاح",
        notFound: "الكورس غير موجود",
    },

    courseDetails: {
        fetched: "تم الحصول على تفاصيل الدورة بنجاح",
    },

    lesson: {
        fetched: "تم الحصول على الدرس بنجاح",
        created: "تم إنشاء الدرس بنجاح",
        updated: "تم تحديث الدرس بنجاح",
        deleted: "تم حذف الدرس بنجاح",
        notFound: "الدرس غير موجود",
    },
    
    category: {
        fetched: "تم الحصول على التصنيف بنجاح",
        created: "تم إنشاء التصنيف بنجاح",
        updated: "تم تعديل التصنيف بنجاح",
        deleted: "تم حذف التصنيف بنجاح",
        notFound: "التصنيف غير موجود",
    },
    
    blog: {
        fetched: "تم الحصول على المدونة بنجاح",
        created: "تم إنشاء المدونة بنجاح",
        updated: "تم تعديل المدونة بنجاح",
        deleted: "تم حذف المدونة بنجاح",
        notFound: "المدونة غير موجود",
    },

    cart: {
        validateitmeType: "نوع العنصر غير صالح. يجب أن يكون منتجاً أو كورس",
        notDbItem: "لم يتم العثور على ({{type}}) بهذا ال ID",
        created: "تمت الإضافة إلى عربة التسوق بنجاح",
        exist: "لا توجد عربة تسوق لهذا المستخدم: ({{user}})",
        deleted: "تمت إزالة العنصر من عربة التسوق بنجاح",
        cleared: "تم إفراغ عربة التسوق بنجاح",
        notFound: 'عربة التسوق غير موجودة',
        itemFound: "لم يتم العثور على عنصر في سلة التسوق لهذا المعرف: ({{id}})",
        invalidCoupon: 'الكوبون غير صالح أو منتهي الصلاحية',
        removeCoupon: "تمت إزالة الكوبون بنجاح",
    },

    choose: {
        fetched: "تم الحصول على البيانات بنجاح",
        updated: "تم التحديث بنجاح",
    },

    contact: {
        fetched: "تم الحصول على بيانات رسالة التواصل بنجاح",
        created: "تم إنشاء رسالة التواصل بنجاح",
        updated: "تم تحديث رسالة التواصل بنجاح",
        deleted: "تم حذف رسالة التواصل بنجاح",
        notFound: "لم يتم العثور على رسالة التواصل",
    },

    coupon: {
        fetched: "تم الحصول على الكوبون بنجاح",
        created: "تم إنشاء الكوبون بنجاح",
        updated: "تم تعديل الكوبون بنجاح",
        deleted: "تم حذف الكوبون بنجاح",
        notFound: "الكوبون غير موجود",
    },

    dashboard: {
        fetched: "تم الحصول على لوحة المعلومات بنجاح",
    },

    hero: {
        created: "تم إنشاء الـ Hero بنجاح",
        updated: "تم تعديل الـ Hero بنجاح",
        deleted: "تم حذف الـ Hero بنجاح",
    },

    journey: {
        fetched: "تم الحصول على بيانات الرحلة بنجاح",
        updated: "تم تحديث بيانات الرحلة بنجاح",
    },

    fields: {
        email: "البريد الإلكتروني",
        title: "العنوان",
        slug: "الرابط",
    },

    auth: {
        sentOtp: "تم إرسال رمز التحقق إلى بريدك الإلكتروني لإتمام عملية التحقق",
        verifiedEmail: "تم التحقق من المستخدم بنجاح",
        verifiedPassword: "تم التحقق من رمز التحقق، يمكنك إعادة تعيين كلمة المرور الآن",
        resendEmail: "تم إرسال رمز التحقق لمرة واحدة بنجاح",
        resendPassword: "تمت إعادة إرسال رمز التحقق لمرة واحدة بنجاح",
        notmatchPassword: "كلمتا المرور غير متطابقتين",
        notFound: "المستخدم غير موجود",
        successMessage: "تمت إعادة تعيين كلمة المرور بنجاح",
        invalidResetToken: "رمز إعادة التعيين غير صالح أو منتهي الصلاحية؛ يرجى إرسال بريدك الإلكتروني مرة أخرى",
        verifyFisrt: "يرجى التحقق من حسابك أولاً",
        incorrectPass: "كلمة المرور غير صحيحة",
        successLogin: "تم تسجيل الدخول بنجاح",
        PleaseLoginToAccess: "غير مصرح لك بالوصول. يرجى تسجيل الدخول للوصول إلى هذا المورد",
        sessionExpired: "انتهت صلاحية الجلسة، يرجى تسجيل الدخول مرة أخرى",
        invalidToken: "الرمز الصلاحية غير صالح. يرجى تسجيل الدخول مرة أخرى",
        roleNotAllowed: "الدور ({{role}}) غير مسموح له بالوصول إلى هذا المورد",
        logout: "تم تسجيل الدخول بنجاح",
    },

    user: {
        fetched: "تم الحصول على بيانات المستخدم بنجاح",
        updated: "تم تعديل المستخدم بنجاح",
        deleted: "تم حذف المستخدم بنجاح",
        notFound: "المستخدم غير موجود",
        notAllowed: "غير مسموح لك بتغيير كلمة مرور مستخدم آخر",
        incorrectCurrentPassword: "كلمة المرور الحالية غير صحيحة",
        notMatchComfirmPassword: "تأكيد كلمة المرور غير متطابق",
        newPasswordDifferent: "يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمة المرور الحالية",
        successMessagePassword: "تم تغيير كلمة المرور بنجاح",
        fetchedThemeMode: "تم الحصول على وضع السمة بنجاح",
        updatedThemeMode: "تم تحديث وضع السمة بنجاح",
        cannotDeactivate: "لا يمكنك إلغاء تنشيط حسابك الخاص",
        cannotChangeOwnRole: "لا يمكنك تغيير دورك كمسؤول",
        administratorDeactivatedAccount: "تم إلغاء تنشيط حسابك من قِبَل المسؤول",
        // administratorDeactivatedAccount
    },

    order: {
        fetched: "تم الحصول على الطلب بنجاح",
        createdCash: "تم إنشاء الطلب النقدي بنجاح.",
        createdPaymob: "تم إنشاء طلب الدفع في Paymob بنجاح",
        updated: "تم تحديث الطلب بنجاح",
        deleted: "تم حذف الطلب بنجاح",
        notFound: "لم يتم العثور على الطلب",
        payPalIdNotFound: "لم يتم العثور على ID الدفع من PayPal لهذا الطلب",
        paypalCompleted: "تم إتمام الدفع بنجاح عبر PayPal",
        paypalNotCompleted: "لم تكتمل عملية الدفع عبر PayPal",
        noCart: "لا توجد عربة تسوق لهذا المستخدم: ({{user}})",
        InvalidPayment: "تم اختيار نوع دفع غير صالح",
        alreadyPaid: "تم دفع قيمة الطلب بالفعل",
        alreadyCancelled: "تم إلغاء الطلب بالفعل.",
        notCancelled: "لا يمكن إلغاء الطلبات المدفوعة؛ إذ يتطلب الأمر استرداد المبلغ.",
        cancelled: "تم إلغاء الطلب بنجاح",
    },

    enrollment: {
        fetched: "تم الحصول على بيانات الاشتراك بنجاح",
        updated: "تم تعديل الاشتراك بنجاح",
        deleted: "تم حذف الاشتراك بنجاح",
        notFound: "الاشتراك غير موجود",
    },

    partner: {
        fetched: "تم الحصول على الشريك بنجاح",
        created: "تم إنشاء الشريك بنجاح",
        updated: "تم تعديل الشريك بنجاح",
        deleted: "تم حذف الشريك بنجاح",
        notFound: "الشريك غير موجود",
    },

    portfolio: {
        fetched: "تم الحصول على المشروع بنجاح",
        created: "تم إنشاء المشروع بنجاح",
        updated: "تم تعديل المشروع بنجاح",
        deleted: "تم حذف المشروع بنجاح",
        notFound: "المشروع غير موجود",
    },
    
    product: {
        fetched: "تم الحصول على المنتج بنجاح",
        created: "تم إنشاء المنتج بنجاح",
        updated: "تم تعديل المنتج بنجاح",
        deleted: "تم حذف المنتج بنجاح",
        notFound: "المنتج غير موجود",
    },

    progress: {
        fetched: "تم الحصول على تقدم الكورس بنجاح",
        continueWatchingFetched: "تابع المشاهدة، تم جلبها بنجاح",
        updated: "تم تحديث التقدم بنجاح",
        notEnrolledCourse: "أنت لست مسجلاً في هذا الكورس.",
    },

    review: {
        fetched: "تم الحصول على التقييم بنجاح",
        created: "تم انشاء التقييم  بنجاح",
        updated: "تم تحديث التقييم بنجاح",
        deleted: "تم حذف التقييم بنجاح",
        notFound: "التقييم غير موجود",
        mustEnroll: "يجب عليك التسجيل في هذه الكورس قبل كتابة مراجعة",
        alreadyReviewed: "لقد قمت بالفعل بتقييم هذا الكورس",
    },

    service: {
        fetched: "تم الحصول على الخدمة بنجاح",
        created: "تم انشاء الخدمة بنجاح",
        updated: "تم تحديث الخدمة بنجاح",
        deleted: "تم حذف الخدمة بنجاح",
        notFound: "الخدمة غير موجودة",
    },

    settings: {
        fetched: "تم الحصول على الاعدادات بنجاح",
        themeFetched: "تم الحصول على السمة بنجاح",
        created: "تم انشاء الاعدادات بنجاح",
        updated: "تم تحديث الاعدادات بنجاح",
        themeUpdated: "تم تحديث السمة بنجاح",
        deleted: "تم حذف الاعدادات بنجاح",
        notFound: "الاعدادات غير موجودة",
    },

    team: {
        fetched: "تم الحصول على الفريق بنجاح",
        created: "تم انشاء عضو الفريق بنجاح",
        updated: "تم تحديث عضو الفريق بنجاح",
        deleted: "تم حذف عضو الفريق بنجاح",
        notFound: "عضو الفريق غير موجود",
    },

    timeline: {
        fetched: "تم الحصول على الجدول الزمني بنجاح",
        created: "تم إنشاء الجدول الزمني بنجاح",
        updated: "تم تحديث الجدول الزمني بنجاح",
        deleted: "تم حذف الجدول الزمني بنجاح",
        notFound: "الجدول ازمني غير موجود",
    },

    wishlist: {
        fetched: "تم الحصول على قائمة الرغبات بنجاح",
        added: "تمت إضافة الكورس بنجاح إلى قائمة رغباتك.",
        removed: "تمت إزالة الكورس بنجاح من قائمة رغباتك.",
    },
};