module.exports = {
    common: {
        success: "تمت العملية بنجاح",
        failed: "حدث خطأ",
        notFound: "العنصر غير موجود",
        duplicate: "القيمة {{value}} موجودة بالفعل في حقل {{field}}",
    },

    course: {
        fetched: "تم جلب الكورس بنجاح",
        created: "تم إنشاء الكورس بنجاح",
        updated: "تم تعديل الكورس بنجاح",
        deleted: "تم حذف الكورس بنجاح",
        notFound: "الكورس غير موجود",
    },

    hero: {
        created: "تم إنشاء الـ Hero بنجاح",
        updated: "تم تعديل الـ Hero بنجاح",
        deleted: "تم حذف الـ Hero بنجاح",
    },

    fields: {
        email: "البريد الإلكتروني",
        title: "العنوان",
        slug: "الرابط",
    },

    auth: {
        sentOtp: "تم إرسال رمز التحقق إلى بريدك الإلكتروني لإتمام عملية التحقق",
        verifiedEmail: "تم التحقق من المستخدم بنجاح",
        verifiedPassword: "تم التحقق من رمز التحقق، يمكنك إعادة تعيين كلمة المرور الآن",
        resendEmail: "تم إرسال رمز التحقق لمرة واحدة بنجاح",
        resendPassword: "تمت إعادة إرسال رمز التحقق لمرة واحدة بنجاح",
        notmatchPassword: "كلمتا المرور غير متطابقتين",
        notFound: "المستخدم غير موجود",
        successMessage: "تمت إعادة تعيين كلمة المرور بنجاح",
        invalidResetToken: "رمز إعادة التعيين غير صالح أو منتهي الصلاحية؛ يرجى إرسال بريدك الإلكتروني مرة أخرى",
        verifyFisrt: "يرجى التحقق من حسابك أولاً",
        incorrectPass: "كلمة المرور غير صحيحة",
        successLogin: "تم تسجيل الدخول بنجاح"
    }
};